profiling/stage_4/get_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.126ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.101ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.543ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.02ms  502.71us  18.78ms   89.99%
    Req/Sec     1.38k   672.43     3.56k    61.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.99ms
 75.000%    1.25ms
 90.000%    1.41ms
 99.000%    2.01ms
 99.900%    7.28ms
 99.990%   12.41ms
 99.999%   14.84ms
100.000%   18.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.287     0.000000            1         1.00
       0.565     0.100000         9767         1.11
       0.678     0.200000        19560         1.25
       0.783     0.300000        29362         1.43
       0.884     0.400000        39114         1.67
       0.986     0.500000        48859         2.00
       1.036     0.550000        53725         2.22
       1.088     0.600000        58609         2.50
       1.142     0.650000        63459         2.86
       1.196     0.700000        68350         3.33
       1.249     0.750000        73283         4.00
       1.274     0.775000        75687         4.44
       1.299     0.800000        78086         5.00
       1.326     0.825000        80569         5.71
       1.353     0.850000        82992         6.67
       1.382     0.875000        85437         8.00
       1.398     0.887500        86682         8.89
       1.414     0.900000        87842        10.00
       1.433     0.912500        89106        11.43
       1.452     0.925000        90304        13.33
       1.475     0.937500        91522        16.00
       1.488     0.943750        92140        17.78
       1.502     0.950000        92728        20.00
       1.520     0.956250        93335        22.86
       1.542     0.962500        93946        26.67
       1.571     0.968750        94556        32.00
       1.590     0.971875        94847        35.56
       1.616     0.975000        95165        40.00
       1.649     0.978125        95467        45.71
       1.686     0.981250        95768        53.33
       1.731     0.984375        96067        64.00
       1.767     0.985938        96219        71.11
       1.832     0.987500        96374        80.00
       1.921     0.989062        96523        91.43
       2.083     0.990625        96676       106.67
       2.327     0.992188        96828       128.00
       2.605     0.992969        96905       142.22
       2.847     0.993750        96981       160.00
       3.191     0.994531        97057       182.86
       3.681     0.995313        97134       213.33
       4.143     0.996094        97209       256.00
       4.391     0.996484        97247       284.44
       4.743     0.996875        97286       320.00
       4.987     0.997266        97324       365.71
       5.287     0.997656        97362       426.67
       5.691     0.998047        97400       512.00
       5.979     0.998242        97420       568.89
       6.251     0.998437        97438       640.00
       6.511     0.998633        97457       731.43
       6.983     0.998828        97476       853.33
       7.351     0.999023        97495      1024.00
       7.707     0.999121        97505      1137.78
       8.011     0.999219        97514      1280.00
       8.167     0.999316        97524      1462.86
       8.455     0.999414        97533      1706.67
       8.807     0.999512        97543      2048.00
       8.967     0.999561        97548      2275.56
       9.191     0.999609        97552      2560.00
       9.383     0.999658        97557      2925.71
      10.031     0.999707        97562      3413.33
      10.207     0.999756        97567      4096.00
      10.535     0.999780        97569      4551.11
      10.631     0.999805        97571      5120.00
      11.087     0.999829        97574      5851.43
      11.391     0.999854        97576      6826.67
      12.271     0.999878        97579      8192.00
      12.415     0.999890        97580      9102.22
      12.495     0.999902        97581     10240.00
      12.791     0.999915        97582     11702.86
      13.183     0.999927        97583     13653.33
      13.767     0.999939        97585     16384.00
      13.767     0.999945        97585     18204.44
      13.919     0.999951        97586     20480.00
      13.919     0.999957        97586     23405.71
      13.951     0.999963        97587     27306.67
      14.087     0.999969        97588     32768.00
      14.087     0.999973        97588     36408.89
      14.087     0.999976        97588     40960.00
      14.087     0.999979        97588     46811.43
      14.839     0.999982        97589     54613.33
      14.839     0.999985        97589     65536.00
      14.839     0.999986        97589     72817.78
      14.839     0.999988        97589     81920.00
      14.839     0.999989        97589     93622.86
      18.799     0.999991        97590    109226.67
      18.799     1.000000        97590          inf
#[Mean    =        1.019, StdDeviation   =        0.503]
#[Max     =       18.784, Total count    =        97590]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  196278 requests in 30.00s, 12.50MB read
  Socket errors: connect 7, read 0, write 0, timeout 13359
  Non-2xx or 3xx responses: 47
Requests/sec:   6542.54
Transfer/sec:    426.69KB