profiling/stage_4/get_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.943ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.934ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.985ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  320.06us   8.36ms   62.54%
    Req/Sec     1.48k   407.47     2.22k    59.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.19ms
 90.000%    1.35ms
 99.000%    1.50ms
 99.900%    2.98ms
 99.990%    4.64ms
 99.999%    6.62ms
100.000%    8.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.283     0.000000            1         1.00
       0.526     0.100000        10581         1.11
       0.626     0.200000        21016         1.25
       0.729     0.300000        31581         1.43
       0.827     0.400000        42092         1.67
       0.926     0.500000        52558         2.00
       0.977     0.550000        57871         2.22
       1.028     0.600000        63079         2.50
       1.080     0.650000        68341         2.86
       1.135     0.700000        73598         3.33
       1.190     0.750000        78818         4.00
       1.217     0.775000        81467         4.44
       1.243     0.800000        84125         5.00
       1.268     0.825000        86689         5.71
       1.294     0.850000        89381         6.67
       1.319     0.875000        92041         8.00
       1.332     0.887500        93295         8.89
       1.346     0.900000        94623        10.00
       1.360     0.912500        95888        11.43
       1.376     0.925000        97211        13.33
       1.393     0.937500        98560        16.00
       1.401     0.943750        99198        17.78
       1.409     0.950000        99840        20.00
       1.419     0.956250       100519        22.86
       1.428     0.962500       101151        26.67
       1.438     0.968750       101795        32.00
       1.444     0.971875       102117        35.56
       1.450     0.975000       102444        40.00
       1.456     0.978125       102775        45.71
       1.464     0.981250       103126        53.33
       1.472     0.984375       103441        64.00
       1.477     0.985938       103607        71.11
       1.483     0.987500       103767        80.00
       1.490     0.989062       103918        91.43
       1.500     0.990625       104090       106.67
       1.517     0.992188       104248       128.00
       1.533     0.992969       104326       142.22
       1.555     0.993750       104410       160.00
       1.582     0.994531       104491       182.86
       1.623     0.995313       104571       213.33
       1.688     0.996094       104653       256.00
       1.726     0.996484       104693       284.44
       1.766     0.996875       104734       320.00
       1.868     0.997266       104775       365.71
       2.007     0.997656       104816       426.67
       2.199     0.998047       104857       512.00
       2.291     0.998242       104878       568.89
       2.427     0.998437       104898       640.00
       2.577     0.998633       104919       731.43
       2.759     0.998828       104939       853.33
       3.013     0.999023       104960      1024.00
       3.147     0.999121       104970      1137.78
       3.319     0.999219       104980      1280.00
       3.451     0.999316       104991      1462.86
       3.533     0.999414       105001      1706.67
       3.673     0.999512       105012      2048.00
       3.755     0.999561       105016      2275.56
       3.837     0.999609       105021      2560.00
       3.875     0.999658       105027      2925.71
       3.997     0.999707       105032      3413.33
       4.111     0.999756       105037      4096.00
       4.147     0.999780       105039      4551.11
       4.179     0.999805       105042      5120.00
       4.255     0.999829       105045      5851.43
       4.303     0.999854       105047      6826.67
       4.631     0.999878       105050      8192.00
       4.643     0.999890       105051      9102.22
       4.647     0.999902       105052     10240.00
       4.755     0.999915       105054     11702.86
       4.759     0.999927       105055     13653.33
       5.063     0.999939       105056     16384.00
       5.091     0.999945       105057     18204.44
       5.091     0.999951       105057     20480.00
       5.327     0.999957       105058     23405.71
       5.431     0.999963       105059     27306.67
       5.431     0.999969       105059     32768.00
       5.467     0.999973       105060     36408.89
       5.467     0.999976       105060     40960.00
       5.467     0.999979       105060     46811.43
       6.619     0.999982       105061     54613.33
       6.619     0.999985       105061     65536.00
       6.619     0.999986       105061     72817.78
       6.619     0.999988       105061     81920.00
       6.619     0.999989       105061     93622.86
       8.367     0.999991       105062    109226.67
       8.367     1.000000       105062          inf
#[Mean    =        0.938, StdDeviation   =        0.320]
#[Max     =        8.360, Total count    =       105062]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  169335 requests in 30.00s, 10.78MB read
  Socket errors: connect 7, read 0, write 0, timeout 13450
Requests/sec:   5644.61
Transfer/sec:    367.95KB